Tekla Open API Reference for Tekla Structures 2025
LinkFrameAttributes Properties
The LinkFrameAttributes type exposes the following members.
Properties
Name | Description
Color |  Obsolete.
Line
 Gets or sets the line type.
LineType |  Obsolete.
Top
See Also
Reference
LinkFrameAttributes Class
Tekla.Structures.Drawing Namespace